#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

data.terraform_remote_state.domain_prod_gcp_infra: Reading...
data.terraform_remote_state.domain_prod_gcp_infra: Read complete after 1s
google_storage_bucket_object.blockchain_etl_dataflow: Refreshing state... [id=prod-im-data-imx-resource-dataflow-templates/blockchain-etl-dataflow/metadata.json]
google_dataflow_flex_template_job.flex_template_job: Refreshing state... [id=2023-07-18_20_17_46-8276860884629993580]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_dataflow_flex_template_job.flex_template_job must be replaced
-/+ resource "google_dataflow_flex_template_job" "flex_template_job" {
      ~ additional_experiments       = [] -> (known after apply)
      ~ id                           = "2023-07-18_20_17_46-8276860884629993580" -> (known after apply)
      ~ job_id                       = "2023-07-18_20_17_46-8276860884629993580" -> (known after apply)
      - labels                       = {} -> null
      - machine_type                 = "n1-standard-1" -> null
      - max_workers                  = 0 -> null
      ~ name                         = "zkevm-imtbl-testnet-13392-etl-dataflow-20230719-031746" # forces replacement -> (known after apply) # forces replacement
      - num_workers                  = 0 -> null
      ~ parameters                   = {
          ~ "chainConfigFile"             = "/template/blockchain_zkevm_imtbl_testnet_13392_prod.json" -> "/template/blockchain_zkevm_imtbl_testnet_prod.json"
            # (11 unchanged elements hidden)
        }
      ~ service_account_email        = "692943280739-compute@developer.gserviceaccount.com" -> (known after apply)
      ~ staging_location             = "gs://dataflow-staging-us-central1-692943280739/staging" -> (known after apply)
      ~ state                        = "JOB_STATE_RUNNING" -> (known after apply)
      ~ temp_location                = "gs://prod-im-data-imx-resource/ethereum-etl/temp" -> (known after apply)
      ~ type                         = "JOB_TYPE_STREAMING" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @roopak-immutable, Action: `pull_request`, Workflow: `Deploy blockchain etl datafow into GCP`*